export const post_0 = {
  title: '官宣！Rust基金会正式成立，五大科技巨头将投入百万美元支持项目开发',
  subTitle: 'Rust 基金会是一个新的独立的非盈利组织，负责管理Rust编程语言及生态。',
  poster: 'post_0_poster.webp',
  postDate: '2021-02-09 11:43',
  thumbnail: '',
  contentList: [
    {
      type: 'hashtag',
      value: 'Rust 基金会成立'
    },
    {
      type: 'textList',
      value: [
        '美国东部时间 2 月 8 日，Rust 基金会 宣布 正式成立。',
        'Rust 基金会是一个新的独立的非盈利组织，负责管理Rust编程语言及生态。该组织将致力于为那些管理和开发该项目的维护者提供支持。Rust 基金会将于美东时间 2 月 9 日下午 4 点举行第一次董事会会议。',
        'Rust 基金会由 AWS、华为、谷歌、微软和 Mozilla 联合成立，并承诺在两年的时间里，投入 100 万美元的预算，用于 Rust 项目的开发、维护和推广。',
        '新 Rust 董事会将由 5 名来自创始公司 AWS、华为、谷歌、微软和 Mozilla 的董事和 5 名来自项目领导层的董事组成。',
        'Rust 基金会临时执行董事，核心团队成员 Ashley Williams 表示，“这标志着Rust在多维度上都迈出了一大步；更重要的是，一些全球行业领先的公司做出了正式的财务上的预判：Rust将是未来企业生产中不可缺少的技术。”',
        'Rust 最初是 Mozilla 内部的一个副项目，专门用于火狐浏览器的开发工作，号称是 C 语言和 C++ 的继任者。Rust 由 Mozilla Research 的 Graydon Hore 设计，并得到了 JavaScript 创始人 Brendan Eich 等人的贡献，成为 Firefox 浏览器及其 Gecko 引擎以及 Mozilla 的 Servo 引擎一些基本特性的核心语言。',
        '但在去年 8 月的一轮裁员之后，Mozilla 遣散了约 250 名员工，其中包括不少原 Rust 团队的活跃开发人员。Rust 团队中的许多人失去了工作，在没有主要赞助商的情况下，尽管项目本身有成千上万的贡献者和大量的企业用户 ， 但这门编程语言的未来变得很不明朗。',
        '一个大型的开源项目通常需要某种指导，新成立的基金会将提供这种指导。它需要一个法律实体来管理社区的各个方面，比如商标。',
        '2020 年 8 月，Mozilla 宣布成立 Rust 基金会的计划。目前，Mozilla 已将所有商标和基础设施资产转移到了新的 Rust 基金会。',
        '“Mozilla 孵化 Rust，是为了打造一个更好的 Firefox，为创建更好的互联网做出贡献”，“在 Rust 基金会的新家，Rust 将有发展成功的空间，同时继续扩大 Mozilla 与 Rust 社区共享的一些核心价值。”Mozilla 和 Rust 基金会董事会成员 Bobby Holley 在一份声明中写道。',
        '所有公司赞助商都对 Rust 具有既得利益，并正在使用它来构建（和重建）其某些堆栈的核心方面。谷歌最近表示，它将资助一个基于 Rust 的项目，该项目旨在使 Apache Web 服务器更安全；微软最近也 组建了 Rust 团队，且正在使用该语言重写一些核心 Windows API。AWS 最近 推出了Bottlerocket，这是一种用于容器的新 Linux 发行版，例如，其功能部件主要用 Rust 编写。',
      ]
    },
    {
      type: 'hashtag',
      value: '谷歌宣布加入 Rust 基金会'
    },
    {
      type: 'textList',
      value: [
        '与此同时，谷歌开源博客在美东时间 2 月 8 日发表 声明 称，正式加入 Rust 基金会。',
        '谷歌表示，“基于谷歌在 C/C++、编译器和工具链方面的长期投资，我们很高兴地宣布我们成为了 Rust 基金会的成员。我们期待更多地参与到 Rust 社区，尤其是在整个行业的关键问题上做出更多努力，包括与 C++ 的互操作性、协调安全审查和降低 crate 更新的成本，并继续增加我们对现有 Rust 项目的投资”。',
        '内存安全中的安全缺陷经常威胁设备的安全，特别是应用程序和操作系统上尤为明显。例如，在 Android 上，谷歌在 2019 年解决的安全漏洞中有一半以上来自内存安全漏洞。尽管谷歌和其他贡献者为 Android 开源项目投入了巨大的努力，他们参与投资或发明了各种技术，包括 AddressSanitizer、改进的内存分配器、大量的 fuzzers 和其他代码检查工具，内存安全问题仍然不可小觑。',
        'Rust 是一种系统编程语言，它把对性能的低程度控制与现代语言特征相结合，同时它也关注内存安全。因此，谷歌希望能够扩展 Rust 在谷歌中的应用。谷歌表示，将继续对 Rust 基金会和 Rust 生态系统做出贡献。谷歌已经开始在那些对内存安全和性能要求极高的设置中使用了 Rust，包括将其用在关键的 Android 系统中。',
        '目前，谷歌正在使用 Rust 或对 Rust 生态系统有贡献的项目包括：',
        ' ● Android 中的操作系统模块，包括蓝牙和 Keystore 2.0',
        ' ● 低级别的项目，例如 ChromeOS 中使用的 crosvm 虚拟机监视器和驱动程序（QEMU 的替代方案）',
        ' ● 为使用 Rust 的开源项目做出的贡献，例如 Mercurial 源代码控制系统',
        ' ● 固件的 FIDO 安全密钥支持',
        '',
        '此外，还有许多其他项目正在评估 Rust 在新的库或产品中的使用情况。一些例子包括：',
        ' ● 软件国际化项目，ICU4X',
        ' ● 部分新实验操作系统 Fuchsia',
        ' ● GPU 字体渲染的研究',
        '',
        '谷歌所支持的 Rust 项目及其维护者有：',
        ' ● 在 curl 中添加 Rust 代码',
        ' ● 与 ISRG 合作，将 Rust TLS 模块添加到 Apache HTTP 服务器项目',
        '声明中，谷歌表示，“我们非常迫切地想要在整个行业中为现有的项目和库做出贡献并提供支持，同时希望在 C++ 互操作性和安全审查等领域中发挥余力”。'
      ]
    },
    {
      type: 'hashtag',
      value: 'Facebook、微软、谷歌与亚马逊争抢 Rust 人才'
    },
    {
      type: 'textList',
      value: [
        '过去几个月以来，Amazon、Facebook、微软以及谷歌等科技巨头正疯狂吸纳人才市场上的 Rust 语言程序员。',
        '去年， 8 月，Mozilla 因盈利问题解雇了 250 名员工，其中包括 Rust 项目和 Rust 社区的成员。随后，一些 Rust 维护者加入了 Amazon 和 Facebook 等企业，领导他们新组建的 Rust 团队。Niko Matsakis 加入了亚马逊，Patrick Walton 加入了 Facebook，成为 Rust 团队的技术负责人。',
        'Facebook 公司目前正全面招聘 Rust 开发人员。虽然新的 Rust 团队目前规模还不大，但 Facebook 打算“慢慢来”。该团队将重点确保 Rust 语言与 Facebook 现有 C++ 代码相协调，构建代码库并提供用于支持系统顺利运行的 Rust 开源代码。',
        '与此同时，微软软件工程合伙人 Chris McKinsey 提到，他们也建立了专项团队以支持公司内部的 Rust 项目，并与该语言社区合作整理说明文档、开发工具等。',
        '在谷歌，自 Mozilla 投奔而来的 Goregaokar 目前正构建一套国际化 Rust 库，并有意继续投入该语言的开源项目开发中去。Goregaokar 解释道，谷歌之所以选择 Rust 语言，部分原因是它能够与其他语言轻松集成。搜索巨头还使用 Rust 语言构建了 Fuschia——这是一种全新操作系统，有望最终取代 Android。',
        '这场“抢人大战”，源自各方着力筹备的 Rust 团队组建计划。凭借着出色的内存效率、速度与安全性，Rust 语言近年来的优势地位愈发明显。事实上，Rust 正越来越被视为 Go 以及 C++/C 等传统编程语言的现代替代选项。',
        '各大厂商开始使用 Rust 语言支持从网站到开发者工具、再到电子游戏的多种应用场景。Facebook 一直在使用 Rust 语言构建 Diem 币（即原 Libra 币），Amazon 则使用 Rust 为其无服务器平台 Lambda（此平台允许开发者在无需管理底层服务器的前提下，轻松运行并扩展开发代码）等产品编写代码。',
        'Rust 人才的动向，也标志着该语言社区在发展进程中迎来了新的转折点。',
        '负责维护 Rust 开源项目的团队核心成员 Ashley Williams 表示，在 Mozilla 着手裁员之后，该社区对 Rust 的未来命运确实有过忧虑。但好在各大科技巨头积极吸纳了 Rust 人才并计划对相关项目做出贡献，这无疑成为 Rust 语言未来看涨的明确信号。',
        'Williams 还在采访中指出，“面向未来，我们期待看到更多独特且令人兴奋的 Rust 使用方式。这是一种非常强大、非常安全的语言。Rust 将在高质量软件套件的构建与协作领域发挥重要作用。”'
      ]
    },
    {
      type: 'hashtag',
      value: '十年来，Rust 常登开发者最受欢迎编程语言榜'
    },
    {
      type: 'textList',
      value: [
        '在过去的十年里，Rust 是最受开发人员喜欢的语言之一。',
        '自 2016 年起，据 Stack Overflow 开发者调查显示，由于许多开发人员开始更多选择 Rust 而不是 Java 来进行开发，Rust 语言开始成为人们关注的焦点，大家希望 Rust 不仅仅是构建浏览器引擎的语言。',
        'Rust 逐渐开始在游戏开发、嵌入式设备、Web 编程、网络、开发者工具以及其他软件领域发挥重要作用。根据微软 GitHub 上的数据，Rust 采用率在 2019 年增长了 235%，这也使其成为增长速度最快的编程语言之一。',
        '开发者也对 Rust 表达了强烈的喜爱之情。在过去的五年中，Rust 在 StackOverflow 开发者调查最受欢迎的编程语言榜单中，一直位居榜首。',
        '在 2020 年开发者调查中，有 86.1 ％的开发人员正在使用该语言或相关技术进行开发，并且有兴趣继续使用该语言。这几乎是 C++ 收到的投票数量的两倍！在同一项调查中，美国本土的 Rust 开发者年薪中位数为 13 万美元。',
        'Rust 提出了“没有数据竞争的并发性”、“没有垃圾收集的内存安全”以及最终的“无恐惧的黑客”等概念，反映了 Rust 独特的学术研究和工业实用性结合价值。',
        'Rust 的影响不仅仅是技术上的。正如社区领袖在 2016 年发表的一系列博客文章所讨论的那样，Rust 的产品既不是编程语言，也不是编译器。它遵循 Rust 的网站上的官方口号— 一种让每个人都能构建可靠和高效软件的语言。',
        'Rust 基金会临时执行董事，核心团队成员 Ashley Williams 认为，一种语言赋予每个人，尤其是那些认为系统编程不适合他们的人。Rust 项目最强大的驱动力之一是相信系统编程的力量，并承诺确保每个人都可以使用这种力量。Rust 授权信息的核心可访问性激励了项目的每个部分，从一流的包管理和开发人员工具链，到信息和文档文化，到国际活动组织者和翻译人员，到行为准则和审核团队。',
        'Rust 不仅仅是一种编程语言和一个社区，Rust 还代表了一种新的、激进的、在开源项目上进行合作的方式。Rust 项目中的决策权是唯一的授权和分布，核心团队拥有更多特权。',
        '自项目首次发布以来， Rust 拥有 100 多名团队成员作为项目设计和维护的领导者，仅 Rust-lang / Rust repo 就有近 6000 名贡献者。通过 Rust 的 RFC 流程，超过 1000 人做出了将近 500 个决策，这些决策代表了该项目最关键和最具战略意义的产品和设计决策。',
        '',
        '',
        '',
        '参考链接：',
        'https://techcrunch.com/2021/02/08/the-Rust-programming-language-finds-a-new-home-in-a-non-profit-foundation',
        'https://opensource.googleblog.com/2021/02/google-joins-Rust-foundation.html',
        'https://foundation.Rust-lang.org/posts/2021-02-08-hello-world/'
      ]
    },
  ],
}
